Reports/ОтделТехническогоКонтроля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Report>
		<Properties>
			<Name>ОтделТехническогоКонтроля</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Enums/ВидыПодразделений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ВидыПодразделений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Управление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ОтделТехническогоКонтроля/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьНаСервере(ВремяНаКлиенте)
	
	Отчеты.ОтделТехническогоКонтроля.СформироватьОтчет(ТабличныйДокумент, Отчет.Подразделение, ВремяНаКлиенте);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере(ТекущаяДата());
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	фПодразделение = ПараметрыСеанса.ТекущееПодразделение;
	Если фПодразделение.ВидПодразделения = Перечисления.ВидыПодразделений.Производство Тогда
		Отчет.Подразделение = фПодразделение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Отчет.Подразделение) Тогда
		СформироватьНаСервере(ТекущаяДата()); // ПриСозданииНаСервере нельзя, т.к. нужна клиентская дата
	КонецЕсли;
	
КонецПроцедуры
